[{"Code":"CS 105","Name":"Digital Life Through Multimedia","Description":"\"Multimedia has emerged as a common thread with which to connect individuals to the digital world. The course uses various multimedia technologies to explore everyday life, the societal impact of digitally produced resources and how the Web is exploited by both individuals and organizations. Emphasis is placed on how multimedia is used for life in college and the world of work.\""},{"Code":"CS 180","Name":"Introduction to Programming","Description":"\"As an introductory course to programming in Java, it includes a history of computers and computing. Students are also introduced to programming in HTML to create standards compliant websites.\""},{"Code":"CS 220","Name":"Introduction to Networking Technologies","Description":"\"The course concentrates on the theory and practical application of networking principles, with an emphasis on the technical components of data and voice communications and TCP\\\/IP.\""},{"Code":"CS 270","Name":"Introduction to Database Structures","Description":"\"Concepts of files, databases, data objects, and presentation of data in various formats are covered. Introduction to types of database applications includes student project and use of open source tools such as MySQL and PhP.\""},{"Code":"CS 301","Name":"Information Systems: Analysis and Design","Description":false},{"Code":"CS 302","Name":" Information Systems: Design and Implementation","Description":"\"Continues the work started in CS301. This course completes the study of information systems design and implementation processes. Students will be required to complete a major project, created specifically to apply their knowledge at a practical level. Emphasis is placed on the participatory nature of system design and implementation and will require active contributions by the students during and outside of official class hours.\""},{"Code":"CS 320","Name":"Professional Issues in IT","Description":false},{"Code":"CS 340","Name":"Introduction to Web Development","Description":"\"This course introduces the students to core concepts of developing for the web environment including end-user interface, back-end, database and client\\\/server interactions. Various languages are utilized during completion of individual and team projects.\""},{"Code":"CS 430","Name":"Information Security and Network Management","Description":"\"The securing and management of networks poses some of the most complex challenges to the Information Systems\\\/Technology 186 | Undergraduate Catalogue Undergraduate Catalogue | 187 professional. This course, designed to follow CS 220, explores various methods used to secure a network, including commonly used encryption algorithms. Effective network management techniques ensure that all types of information travel the network in an efficient manner.\""},{"Code":"CS 470","Name":"Internship in Computer Science","Description":"\"Students complete this course as part of the internship requirement for the major.\""},{"Code":"CS 480","Name":"Advanced Web Development","Description":"\"This course covers advanced web development techniques, including student and team projects, database development for enterprise systems, and multiple platforms.\""},{"Code":"CS 490","Name":"Topics in Computer Science","Description":"\"Under the supervision of a faculty member of the CIS department, this course provides students the opportunity to conduct research in a topic of their choosing to deepen their knowledge in a particular area of the Computing profession.\""},{"Code":"CS 492","Name":"Information Systems Project (Capstone)","Description":"\"As an integrating course combining all of the elements of successful system development, this is the capstone course for the CIS major. This course is intended to provide the students with an opportunity to implement and complete a project in support of an Edgewood College Community Partner. Working in teams, the students utilize formal project management structures and processes. Through an examination of technologies used for communication, with a special focus on the emerging emphasis on technologies used for social networking, the students completing this community service project will consider this question: As members of the IS\\\/IT profession, in what ways do their roles as purveyors of technology impact and are impacted by the constant shift of technological platform and how does this constant change shape their views. This question will be examined from three contexts: 1) organizations in which they work; 2) their personal lives; and 3) the lives of others with whom they interact. The class will develop a system in accordance with client specifications and present its final results to departments and peers of the college.\""},{"Code":"MATH 121","Name":"Statistics","Description":"\"Course topics include descriptive and inferential statistics with the emphasis on drawing meaningful conclusions from sets of data. Topics include measures of central tendency and dispersion, the normal distribution, z-tests, t-tests, linear regression, analysis of variance. Chi-square tests, and other topics as time permits. This course satisfies the M tag General Education requirement.\""},{"Code":"BUS 280","Name":"Financial Accounting","Description":false},{"Code":"BUS 281","Name":"Managerial Accounting","Description":"\"This course defines the role of management accounting in producing information that is relevant in a fast-paced, competitive environment for internal decision makers within business organizations. Alternative methods for the computation of costs for products and services will be explored including job order costing, process costing, activity based costing and standard costing. The behavior of costs will be analyzed using cost-volume-profit analysis. Cost information will be utilized for budgetary planning and controlling, capital investment decisions, pricing, variance analysis and decision making activities in organizations. (F\\\/S)\""},{"Code":"BUS 302","Name":"Organizational Behavior","Description":"\"This course examines human behavior in work organizations, as well as effective means to manage that behavior in a way that contributes to both organizational effective and human satisfaction. Topics include team development, communication, leadership, motivation, problem solving, and ethical decision making.\""},{"Code":"BUS 304","Name":"Business Law I","Description":false}]
